In [15]:
import numpy as np 
import pandas as pd 
import statistics as st

In [4]:
df = pd.read_csv('Salaries.csv')
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [5]:
# describe for descriptive statistics summary in Pandas
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

# 2 Types of Descriptive Statistics

## Central Tendencies

In [6]:
# mean
df['BasePay'].mean() # methodnya pandas

# digunakan kalau ga ada outlier/pencilan

66325.44884050643

In [7]:
data = [1,2,3,5,7,9]
st.mean(data) # methodnya statistics

4.5

In [8]:
# median
df['BasePay'].median()

# digunakan ketika ada data outlier

65007.45

In [9]:
st.median([1,2,3,4,5,6,7,8,9,10,1000])

6

In [11]:
# kalo pake mean, hasilnya akan beda jauh/ngaco
st.mean([1,2,3,4,5,6,7,8,9,10,1000])

95.9090909090909

In [12]:
# mode
df['JobTitle'].mode()

# digunakan ketika datanya categorical

0    Transit Operator
dtype: object

## Spread

In [13]:
# variance
df['BasePay'].var()

# melihat seberapa bervariasi kah data kita
# makin bervariasi data (range dari setiap data ke rata2nya makin besar), maka nilai variance makin besar

1828814049.0424156

In [15]:
st.variance([5,7,5,6,5,6,6,7,7,3,6])
# data kurang bervariasi, nilai variance kecil

1.4181818181818182

In [14]:
st.variance([1,2,3,5,7,9,7,2,7,6])
# data cukup bervariasi

7.433333333333334

In [17]:
st.variance([1,2,3,5,7,9,7,2,7,6])
#  data sangat bervariasi

7.433333333333334

#

In [16]:
# Standar Deviation
df['BasePay'].std()

# akar dari variance

42764.63549525958

In [18]:
st.stdev([1,2,3,5,7,9,7,2,7,6])

2.7264140062238043

## **Take Class Exercise**: Analyze Salaries Dataset

### ``Show your code and answer this questions!``
### Open Salaries.csv dan Create DataFrame

#### 1. Berapa nilai tengah ``BasePay`` di tahun ``2013``?
#### 2. Berapa rata-rata ``OtherPay`` di tahun ``2014``?
#### 3. Berapa rata-rata ``Benefits`` pada karyawan yang ``TotalPay``-nya di atas rata-rata karyawan di tahun 2014?
#### 4. Berapa nilai standart deviasi ``TotalPay`` pada karyawan ``Transit Operator``?
#### 5. Siapa 5 orang yang berprofesi ``Special Nurse`` dan ``BasePay``-nya di atas rata-rata?
#### 6. Sebutkan 5 profesi (``JobTitle``) dengan gaji tertinggi (``TotalPay``)?
#### 7. Berapa nilai variance ``BasePay`` karyawan ``Public Svc Aide-Public Works`` di tahun 2014?
#### 8. Siapa 5 orang yang berprofesi ``Police Officer 3`` dengan ``TotalPay`` terendah?
#### 9. Berapa standart deviasi ``BasePay`` karyawan ``Registered Nurse`` di tahun 2012 yang ``Benefits``-nya di atas rata-rata?
#### 10. Profesi apa yang paling banyak muncul (mode) dengan nilai ``BasePay`` dan ``Benefits``-nya di atas rata-rata?

In [21]:
sal = pd.read_csv('Salaries.csv')
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [22]:
# 1. Berapa nilai tengah BasePay di tahun 2013?
sal.loc[sal['Year']==2013, 'BasePay'].median()

67669.0

In [23]:
# 2. Berapa rata-rata OtherPay di tahun 2014?
sal.loc[sal['Year']==2014, 'OtherPay'].mean()

3505.4212505574583

In [25]:
# 3. Berapa rata-rata Benefits pada karyawan di tahun 2014 yang TotalPay-nya di atas rata-rata karyawan?

# TotalPay-nya di atas rata-rata seluruh karyawan 
meanTP = sal['TotalPay'].mean()

sal.loc[(sal['TotalPay']> meanTP) & (sal['Year']==2014),'Benefits'].mean()

36934.831982886106

In [29]:
# 4. Berapa nilai standart deviasi TotalPay pada karyawan Transit Operator?
sal.loc[sal['JobTitle']=='Transit Operator','TotalPay'].std()

30035.2498993624

In [34]:
# 5. Siapa 5 orang yang berprofesi Special Nurse dan BasePay-nya di atas rata-rata?

sal.loc[(sal['JobTitle']=='Special Nurse') & (sal['BasePay']>sal['BasePay'].mean()), ['EmployeeName','BasePay']].head()

            EmployeeName    BasePay
39881  Christian Kitchin  133932.19
41793       Laurie Towns  135691.93
42130        Leah Custis  127700.35
42394      Jennifer Chiu  124073.96
42535    Genevieve Hamer  128163.62

In [55]:
# 6. Sebutkan 5 profesi (JobTitle) dengan rata-rat gaji tertinggi (TotalPay)?
sal.groupby('JobTitle')[['JobTitle','TotalPay']].mean().sort_values(by='TotalPay',ascending=False).head()

                                                     TotalPay
JobTitle
GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  399211.275000
Chief Investment Officer                        339653.700000
Chief of Police                                 329183.646667
Chief, Fire Department                          325971.683333
DEPUTY DIRECTOR OF INVESTMENTS                  307899.460000

In [43]:
# 7. Berapa nilai variance BasePay karyawan Public Svc Aide-Public Works di tahun 2014?
sal.loc[(sal['JobTitle']=='Public Svc Aide-Public Works') & (sal['Year']==2014),'BasePay'].var()

45111291.10909396

In [56]:
# 8. Siapa 5 orang yang berprofesi Police Officer 3 dengan TotalPay terendah?
sal.loc[sal['JobTitle']=='Police Officer 3',['EmployeeName','TotalPay']].sort_values(by='TotalPay').head(5)

            EmployeeName  TotalPay
110530     David P Kucia      0.00
110529    Mark E Laherty      0.00
110528  Timothy E Gibson      0.00
106766      Lisa M Curry      0.00
72907       William Pyne     30.78

In [49]:
# 9. Berapa standart deviasi BasePay karyawan Registered Nurse di tahun 2012 yang Benefits-nya di atas rata-rata?
sal.loc[(sal['JobTitle']=='Registered Nurse') & (sal['Year']==2012) & (sal['Benefits']>sal['Benefits'].mean()),'BasePay'].std()

17852.797744061118

In [50]:
# 10. Profesi apa yang paling banyak muncul (mode) dengan nilai BasePay dan Benefits-nya di atas rata-rata?
sal.loc[(sal['BasePay']>sal['BasePay'].mean()) & (sal['Benefits']>sal['Benefits'].mean()),'JobTitle'].mode()

0    Registered Nurse
dtype: object

In [ ]:
# pertama tulis kolom apa yg mau dikasih method: sal['JobTitle'].mode()
# 'JobTitle' adalah kolom
# sebelum kolom, tulis barisnya (bisa conditional), dipisahkan dgn koma
# kalo mau menampilkan kolom>1, bisa tambahin setelah 'JobTitle'
# kalo mau menampilkan kolom>1,dikurung lagi dgn []
# condition harus dikurung ()
# condition 1: (sal['BasePay']>sal['BasePay'].mean())
# condition 2: (sal['Benefits']>sal['Benefits'].mean()
# antar condition dipisah dengan &
# jangan lupa .loc kalau cara penulisannya seperti di atas ini

# TAKE HOME EXCERCISE

# Buat fungsi untuk mencari mean, median, modus, tanpa import library

In [13]:
mylist = [1,2,3,4,5,6,7,7,7,7,8,8,9,9,10,11,12,13,14,100]

# mean

In [16]:
st.mean(mylist)

12.15

In [17]:
# mean

def rata(x):
    return sum(x) / len(x)

In [18]:
rata(mylist)

12.15

# median

In [19]:
st.median(mylist)

7.5

In [21]:
# median

def med(x):

    x.sort()

    if len(x)%2==1:
        a = x[int((len(x)//2))]
    else:
        a = (x[int(len(x)/2)] + x[int((len(x)/2)-1)])/2
    
    return a

In [22]:
med(mylist)

7.5

# modus

In [23]:
st.mode(mylist)

7

In [25]:
# modus
# khusus untuk yg modusnya 1, bukan bi-modal(modus >1) atau no-modal(tidak punya modus)

def mod(listA):
    
    listB = []
    for i in listA:         
        n = 0
        for j in listA:
            if i==j:
                n+=1
        listB.append(n)

    # listB
    # max(listB)
            
    for i in range(len(listB)):
        if listB[i] == max(listB):
            print(listA[i])
            break

In [26]:
mod(mylist)

7

7